Revit 2024 API
BuiltInParameterGroup Enumeration
An enumerated type listing all of the built-in parameter groups supported by Autodesk Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This enumeration is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use members of the `GroupTypeId` class instead.")]
public enum BuiltInParameterGroup
Visual Basic
<ObsoleteAttribute("This enumeration is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use members of the `GroupTypeId` class instead.")> _
Public Enumeration BuiltInParameterGroup
Visual C++
[ObsoleteAttribute(L"This enumeration is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use members of the `GroupTypeId` class instead.")]
public enum class BuiltInParameterGroup
Members
Member name | Description
PG_TOPOSOLID_SUBDIVISION |  "Toposolid Subdivision"
PG_LIFE_SAFETY |  "Life Safety"
PG_ELECTRICAL_ANALYSIS |  "Electrical Analysis"
PG_ALTERNATE_UNITS |  "Alternate Units"
PG_PRIMARY_UNITS |  "Primary Units"
PG_WALL_CROSS_SECTION_DEFINITION |  "Cross-Section Definition"
PG_ROUTE_ANALYSIS |  "Route Analysis"
PG_GEO_LOCATION |  "Geolocation"
PG_STRUCTURAL_SECTION_GEOMETRY |  "Structural Section Geometry"
PG_ENERGY_ANALYSIS_BLDG_CONS_MTL_THERMAL_PROPS |  "Material Thermal Properties"
PG_ENERGY_ANALYSIS_ROOM_SPACE_DATA |  "Room/Space Data"
PG_ENERGY_ANALYSIS_BUILDING_DATA |  "Building Data"
PG_COUPLER_ARRAY |  "Set"
PG_ENERGY_ANALYSIS_ADVANCED |  "Advanced"
PG_RELEASES_MEMBER_FORCES |  "Releases / Member Forces"
PG_SECONDARY_END |  "Secondary End"
PG_PRIMARY_END |  "Primary End"
PG_MOMENTS |  "Moments"
PG_FORCES |  "Forces"
PG_FABRICATION_PRODUCT_DATA |  "Fabrication Product Data"
PG_REFERENCE |  "Reference"
PG_GEOMETRY_POSITIONING |  "Geometric Position"
PG_DIVISION_GEOMETRY |  "Division Geometry"
PG_SEGMENTS_FITTINGS |  "Segments and Fittings"
PG_CONTINUOUSRAIL_END_TOP_EXTENSION |  "Extension (End/Top)"
PG_CONTINUOUSRAIL_BEGIN_BOTTOM_EXTENSION |  "Extension (Beginning/Bottom)"
PG_STAIRS_WINDERS |  "Winders"
PG_STAIRS_SUPPORTS |  "Supports"
PG_STAIRS_OPEN_END_CONNECTION |  "End Connection"
PG_RAILING_SYSTEM_SECONDARY_FAMILY_HANDRAILS |  "Handrail 2"
PG_TERMINATION |  "Terminations"
PG_STAIRS_TREADS_RISERS |  "Threads/Risers"
PG_STAIRS_CALCULATOR_RULES |  "Calculation Rules"
PG_SPLIT_PROFILE_DIMENSIONS |  "Dimensions (linear units or % of thickness)"
PG_LENGTH |  "Length"
PG_NODES |  "Nodes"
PG_ANALYTICAL_PROPERTIES |  "Analytical Properties"
PG_ANALYTICAL_ALIGNMENT |  "Analytical Alignment"
PG_SYSTEMTYPE_RISEDROP |  "Rise / Drop"
PG_LINING |  "Lining"
PG_INSULATION |  "Insulation"
PG_OVERALL_LEGEND |  "Overall Legend"
PG_VISIBILITY |  "Visibility"
PG_SUPPORT |  "Supports"
PG_RAILING_SYSTEM_SEGMENT_V_GRID |  "V Grid"
PG_RAILING_SYSTEM_SEGMENT_U_GRID |  "U Grid"
PG_RAILING_SYSTEM_SEGMENT_POSTS |  "Posts"
PG_RAILING_SYSTEM_SEGMENT_PATTERN_REMAINDER |  "Pattern Remainder"
PG_RAILING_SYSTEM_SEGMENT_PATTERN_REPEAT |  "Pattern Repeat"
PG_RAILING_SYSTEM_FAMILY_SEGMENT_PATTERN |  "Segment Pattern (default)"
PG_RAILING_SYSTEM_FAMILY_HANDRAILS |  "Handrail 1"
PG_RAILING_SYSTEM_FAMILY_TOP_RAIL |  "Top Rail"
PG_CONCEPTUAL_ENERGY_DATA_BUILDING_SERVICES |  "Energy Model - Building Services"
PG_DATA |  "Data"
PG_ELECTRICAL_CIRCUITING |  "Electrical - Circuiting"
PG_GENERAL |  "General"
PG_FLEXIBLE |  "Adaptive Component"
PG_ENERGY_ANALYSIS_CONCEPTUAL_MODEL |  "Energy Analytical Model"
PG_ENERGY_ANALYSIS_DETAILED_MODEL |  "Detailed Model"
PG_ENERGY_ANALYSIS_DETAILED_AND_CONCEPTUAL_MODELS |  "Essential"
PG_FITTING |  "Fittings"
PG_CONCEPTUAL_ENERGY_DATA |  "Conceptual Energy Data"
PG_AREA |  "Area"
PG_ADSK_MODEL_PROPERTIES |  "Model Properties"
PG_CURTAIN_GRID_V |  "V Grid"
PG_CURTAIN_GRID_U |  "U Grid"
PG_DISPLAY |  "Display"
PG_ANALYSIS_RESULTS |  "Analysis Results"
PG_SLAB_SHAPE_EDIT |  "Slab Shape Edit"
PG_LIGHT_PHOTOMETRICS |  "Photometrics"
PG_PATTERN_APPLICATION |  "Pattern Application"
PG_GREEN_BUILDING |  "Green Building Properties"
PG_PROFILE_2 |  "Profile 2"
PG_PROFILE_1 |  "Profile 1"
PG_PROFILE |  "Profile"
PG_TRUSS_FAMILY_BOTTOM_CHORD |  "Bottom Chords"
PG_TRUSS_FAMILY_TOP_CHORD |  "Top Chords"
PG_TRUSS_FAMILY_DIAG_WEB |  "Diagonal Webs"
PG_TRUSS_FAMILY_VERT_WEB |  "Vertical Webs"
PG_TITLE |  "Title Text"
PG_FIRE_PROTECTION |  "Fire Protection"
PG_ROTATION_ABOUT |  "Rotation about"
PG_TRANSLATION_IN |  "Translation in"
PG_ANALYTICAL_MODEL |  "Analytical Model"
PG_REBAR_ARRAY |  "Rebar Set"
PG_REBAR_SYSTEM_LAYERS |  "Layers"
PG_CURTAIN_GRID |  "Grid"
PG_CURTAIN_MULLION_2 |  "Grid 2 Mullions"
PG_CURTAIN_MULLION_HORIZ |  "Horizontal Mullions"
PG_CURTAIN_MULLION_1 |  "Grid 1 Mullions"
PG_CURTAIN_MULLION_VERT |  "Vertical Mullions"
PG_CURTAIN_GRID_2 |  "Grid 2"
PG_CURTAIN_GRID_HORIZ |  "Horizontal Grid"
PG_CURTAIN_GRID_1 |  "Grid 1"
PG_CURTAIN_GRID_VERT |  "Vertical Grid"
PG_IFC |  "IFC Parameters"
PG_ELECTRICAL |  "Electrical"
PG_ENERGY_ANALYSIS |  "Energy Analysis"
PG_STRUCTURAL_ANALYSIS |  "Structural Analysis"
PG_MECHANICAL_AIRFLOW |  "Mechanical - Flow"
PG_MECHANICAL_LOADS |  "Mechanical - Loads"
PG_ELECTRICAL_LOADS |  "Electrical - Loads"
PG_ELECTRICAL_LIGHTING |  "Electrical - Lighting"
PG_TEXT |  "Text"
PG_VIEW_CAMERA |  "Camera"
PG_VIEW_EXTENTS |  "Extents"
PG_PATTERN |  "Pattern"
PG_CONSTRAINTS |  "Constraints"
PG_PHASING |  "Phasing"
PG_MECHANICAL |  "Mechanical"
PG_STRUCTURAL |  "Structural"
PG_PLUMBING |  "Plumbing"
PG_ELECTRICAL_ENGINEERING |  "Electrical Engineering"
PG_STAIR_STRINGERS |  "Stringers"
PG_STAIR_RISERS |  "Risers"
PG_STAIR_TREADS |  "Treads"
PG_UNDERLAY |  "Underlay"
PG_MATERIALS |  "Materials and Finishes"
PG_GRAPHICS |  "Graphics"
PG_CONSTRUCTION |  "Construction"
PG_GEOMETRY |  "Dimensions"
PG_IDENTITY_DATA |  "Identity Data"
INVALID
Remarks
Parameter groups are used to sort parameters within the Element Properties dialog.
See Also
Autodesk.Revit.DB Namespace